app/controllers/posts_controller.rb

  def index

    # Gather all post data
    posts = Post.all
---
SELECT "posts".* FROM "posts"